Revit 2027 API
ParameterTypeId.StructuralSectionCommonDiameter Property
 "Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionCommonDiameter { get; }
Public Shared ReadOnly Property StructuralSectionCommonDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionCommonDiameter {
	ForgeTypeId^ get ();
}
static member StructuralSectionCommonDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace